
/* Intrinsic meaning: General heading level 1 */
"heading1" = "Topmost structural level. Typically used to denote book or other main titles.\nHTML: @<h1>@";

/* Intrinsic meaning: General heading level 2 */
"heading2" = "Second level heading. Typically used as chapter or section header.\nHTML: @<h2>@";

/* Intrinsic meaning: General heading level 3 */
"heading3" = "Third level heading. Typically used in conjunction with Heading 2 to denote subtitles or subsections.\nHTML: @<h3>@";

/* Intrinsic meaning: General heading level 4 */
"heading4" = "Fourth level heading. Typically used to denote sub-subsections.\nHTML: @<h4>@";

/* Intrinsic meaning: General heading level 5 */
"heading5" = "Fifth level heading. Typically used to further structure large sections or chapters.\nHTML: @<h5>@";

/* Intrinsic meaning: General heading level 6 */
"heading6" = "Lowest structural heading. Mostly used as an alternative to Heading 5.\nHTML: @<h6>@";



/* Intrinsic meaning: Enumeration with numbers */
"orderedList" = "A list defined by punctuated numerals, e.g. 1. 2. 3. 24.\nHTML: @<ol>@";

/* Intrinsic meaning: Enumeration with bullets */
"unorderedList" = "A list defined by leading hyphens.\nHTML: @<ul>@";

/* Intrinsic meaning: Block quote */
"blockquote" = "Used to mark whole paragraphs as quoted from another source.\nHTML: @<blockquote>@";

/* Intrinsic meaning: Block quote */
"codeblock" = "Used to insert blocks of computer code. Text will not get parsed, i.e. everything defined as “code” will be output as is.\nHTML: @<pre><code>@";

/* Intrinsic meaning: Block of native contents */
"nativeblock" = "Content that will be exported as-is, unaltered. Possible use includes direct input of HTML code or MultiMarkdown table syntax.";

/* Intrinsic meaning: Comment */
"comment" = "Used to mark whole paragraphs as comments, i.e. to add information of drafting status. Will not get exported or copied.\nHTML: @<!-- … -->@";

/* Intrinsic meaning: Divider (visual horizontal line) */
"divider" = "Used to insert a dedicated split between two paragraphs. May get exported as horizontal rule or page break.\nHTML: @<hr>@";



/* Intrinsic meaning: Block quote */
"code" = "Used to insert computer code. Text will not get parsed, i.e. everything defined as “code” will be output as is.\nHTML: @<pre><code>@";

/* Intrinsic meaning: Native contents */
"inlineNative" = "Content that will be exported as-is, unaltered. Possible use includes direct input of HTML code or MultiMarkdown table syntax.";

/* Intrinsic meaning: some marker */
"mark" = "Used to highlight text passages, e.g. for reference purposes.\nHTML: @<mark>@";

/* Intrinsic meaning: "Strong" marker */
"strong" = "Used to show strong importance of a text passage. Usually transforms to bold when output.\nHTML: @<strong>@";

/* Intrinsic meaning: "Emphasis" marker */
"emph" = "Used to stress emphasis of a text passage. Usually transforms to italics when output.\nHTML: @<em>@";

/* Intrinsic meaning: "Citation" marker */
"cite" = "Used to mark other people’s work, such as an article, a book or a poem.\nHTML: @<cite>@";

/* Intrinsic meaning: "To be deleted" marker */
"delete" = "Used to mark text passages for deletion. Will not get exported or copied.\nHTML: @<del>@, but taken seriously";

/* Intrinsic meaning: "Inline Comment" marker */
"inlineComment" = "Used to mark text passages as comments, i.e. to add additional info to a paragraph or image. Will not get exported or copied.\nHTML: @<!-- … -->@";


/* Intrinsic meaning: Hyperlink */
"link" = "Used to create a hyperlink. Will provide a popover to insert the URL and a title.\nHTML: @<a href=\"…\" title=\"…\">@";

/* Intrinsic meaning: Text Annotation */
"annotation" = "Used to add arbitrary content to text passages, i.e. annotations, additional information etc. Will not get exported or copied.\nHTML: @<!-- … -->@";


/* Intrinsic meaning: Footnote */
"footnote" = "Used to insert a footnote marker. Will provide a popover to create the actual footnote content.";

/* Intrinsic meaning: Image embedded in text */
"image" = "Used to insert an image into the text. Will provide a popover to place the image and add some meta data.\nHTML: @<img>@";

/* Intrinsic meaning: Video embedded in text */
"video" = "Used to insert a video into the text. Will provide a popover to place the video and add some meta data.\nHTML: @<video>@";

